/* Создайте программу, которая запрашивает у пользователя два целых числа a и b, после чего выводит на экран результаты следующих математических операций:
   - сумма a и b;
   - разница между a и b;
   - произведение a и b;
   - частное от деления a и b;
   - остаток от деления a и b;
   - результат от возведения числа a в степень b. */



let a = Number(prompt("Введите число а"));
let b = Number(prompt("Введите число b"));

document.write(`<strong>5. </strong> a= ${a},  b= ${b} <br>`);
document.write(`${a} + ${b} = ${a+b} <br>`);
document.write(`${a} - ${b} = ${a-b} <br>`);
document.write(`${a} * ${b} = ${a*b} <br>`);
document.write(`${a} : ${b} = ${(a/b).toFixed(2)} <br>`);
document.write(`Остаток от деления  ${a} / ${b} = ${a%b} <br>`);
document.write(`Возведения в степень ${a} на ${b} = ${a**b} <br>`);